In [2]:
! pip install pandas

Requirement already satisfied: pandas in /home/alicia/workspace/intro_ml_python/venv/lib/python3.6/site-packages (0.24.1)
Requirement already satisfied: numpy>=1.12.0 in /home/alicia/workspace/intro_ml_python/venv/lib/python3.6/site-packages (from pandas) (1.16.2)
Requirement already satisfied: python-dateutil>=2.5.0 in /home/alicia/workspace/intro_ml_python/venv/lib/python3.6/site-packages (from pandas) (2.8.0)
Requirement already satisfied: pytz>=2011k in /home/alicia/workspace/intro_ml_python/venv/lib/python3.6/site-packages (from pandas) (2018.9)
Requirement already satisfied: six>=1.5 in /home/alicia/workspace/intro_ml_python/venv/lib/python3.6/site-packages (from python-dateutil>=2.5.0->pandas) (1.12.0)

In [8]:
import numpy as np
import pandas as pd

## Estructuras de datos

### Series
- Las series son una matriz etiquetada unidimensional capaz de contener cualquier tipo de datos (enteros, cadenas, números de punto flotante, objetos de Python, etc.)
- Las etiquetas de los ejes se denominan colectivamente índice.

El método básico para crear una serie es llamar a:
```
s = pd.Series (datos, índice = índice) 
```
Aquí, los datos pueden ser muchas cosas diferentes: 
    - un dict de Python 
    - un ndarray 
    - un valor escalar (como 5) 

El índice pasado es una lista de etiquetas de eje.

#### Series desde un np.array

In [10]:
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
s

a    0.812303
b   -0.669101
c   -0.623142
d   -1.583644
e   -0.707557
dtype: float64

In [14]:
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

Si no indicamos nada en los índices, por defecto se creará una secuencia numérica

In [17]:
pd.Series(np.random.randn(5))

0    1.158165
1    0.432360
2    1.710915
3    0.182987
4   -0.643614
dtype: float64

#### Series desde un diccionario

In [19]:
d = {'b': 1, 'a': 0, 'c': 2}
pd.Series(d)

b    1
a    0
c    2
dtype: int64

#### Series desde un valor escalar

In [21]:
pd.Series(5., index=['a', 'b', 'c', 'd', 'e'])

a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

#### Usos de las series
Se pueden usar como un array:

In [28]:
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])

In [29]:
s[0: 3]

a   -0.292287
b    0.042124
c   -1.178330
dtype: float64

In [30]:
s[s > s.median()]

a   -0.292287
b    0.042124
dtype: float64

In [31]:
s.to_numpy()

array([-0.29228746,  0.0421243 , -1.17833043, -0.33598921, -0.64946818])

O como un diccionario:

In [36]:
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
s

a    0.105069
b   -0.928050
c   -1.809939
d   -0.562211
e    0.101968
dtype: float64

In [38]:
s['e'] = 12
s

a     0.105069
b    -0.928050
c    -1.809939
d    -0.562211
e    12.000000
dtype: float64

## DataFrames

- Es una estructura de datos bidimensional etiquetada con columnas de tipos potencialmente diferentes. 
- Se puede considerar como una hoja de cálculo o una tabla SQL. 
- Generalmente es el objeto pandas más utilizado.
- Al igual que Series, DataFrame acepta muchos tipos diferentes de entrada: diccionario de arrays de 1D, listas, dicts, series u otros DataFrame
- Junto con los datos, opcionalmente puede pasar el índice (etiquetas de fila) y los nombres de las columnas. 
- Si no se pasan las etiquetas de los ejes, se construirán a partir de los datos de entrada basados en reglas propias.

#### DataFrames desde diccionarios de Series o diccionarios normales

In [40]:
d = {'one': pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
     'two': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [42]:
pd.DataFrame(d, index=['d', 'b', 'a'])

   one  two
d  NaN  4.0
b  2.0  2.0
a  1.0  1.0

In [44]:
pd.DataFrame(d, index=['d', 'b', 'a'], columns=['two', 'three'])

   two three
d  4.0   NaN
b  2.0   NaN
a  1.0   NaN

#### DataFrames desde diccionarios de ndarrays / lists

In [54]:
d = {'one': [1., 2., 3., 4.],
     'two': [4., 3., 2., 1.]}
pd.DataFrame(d)

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

In [57]:
pd.DataFrame(d, index=['a', 'b', 'c', 'd'])

   one  two
a  1.0  4.0
b  2.0  3.0
c  3.0  2.0
d  4.0  1.0

In [60]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [63]:
pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

                   A         B         C         D
2013-01-01  1.342225  1.470713  0.352388  1.520043
2013-01-02 -0.055552  0.158262 -0.321829  1.140343
2013-01-03  0.063991 -0.190669 -0.728122 -1.161063
2013-01-04 -0.631332  0.875949 -0.642928  0.055541
2013-01-05  0.430018 -0.759634  0.138621 -1.444254
2013-01-06  0.554633  0.246774  0.390896  0.373882

In [65]:
df2 = pd.DataFrame({'A': 1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3] * 4, dtype='int32'),
                    'E': pd.Categorical(["test", "train", "test", "train"]),
                    'F': 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [66]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

#### DataFrames desde listas de diccionarios

In [51]:
data2 = [{'a': 1, 'b': 2}, {'a': 5, 'b': 10, 'c': 20}]
pd.DataFrame(data2)

   a   b     c
0  1   2   NaN
1  5  10  20.0

#### DataFrames desde diccionarios de tuplas (multiindex!)

In [67]:
pd.DataFrame({('a', 'b'): {('A', 'B'): 1, ('A', 'C'): 2},
              ('a', 'a'): {('A', 'C'): 3, ('A', 'B'): 4},
              ('a', 'c'): {('A', 'B'): 5, ('A', 'C'): 6},
              ('b', 'a'): {('A', 'C'): 7, ('A', 'B'): 8},
              ('b', 'b'): {('A', 'D'): 9, ('A', 'B'): 10}})

       a              b
       b    a    c    a     b
A B  1.0  4.0  5.0  8.0  10.0
  C  2.0  3.0  6.0  7.0   NaN
  D  NaN  NaN  NaN  NaN   9.0

### Visualización de los datos

In [72]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -1.598511  0.073137 -0.613317 -0.628046
2013-01-02 -0.138026  0.503681  0.609503 -1.054731
2013-01-03 -0.075906  0.316318 -0.738276 -0.921699
2013-01-04 -0.888494 -0.881555 -0.983365 -1.070701
2013-01-05 -1.279016  0.360456 -1.824948 -0.630740
2013-01-06  0.711144  0.648722  0.213609  0.054974

In [74]:
df.head()

                   A         B         C         D
2013-01-01 -1.598511  0.073137 -0.613317 -0.628046
2013-01-02 -0.138026  0.503681  0.609503 -1.054731
2013-01-03 -0.075906  0.316318 -0.738276 -0.921699
2013-01-04 -0.888494 -0.881555 -0.983365 -1.070701
2013-01-05 -1.279016  0.360456 -1.824948 -0.630740

In [76]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.888494 -0.881555 -0.983365 -1.070701
2013-01-05 -1.279016  0.360456 -1.824948 -0.630740
2013-01-06  0.711144  0.648722  0.213609  0.054974

In [78]:
df.to_numpy()

array([[-1.59851108,  0.07313656, -0.61331654, -0.62804641],
       [-0.13802622,  0.50368058,  0.60950338, -1.05473112],
       [-0.07590561,  0.31631824, -0.73827594, -0.92169862],
       [-0.88849392, -0.88155535, -0.98336514, -1.0707013 ],
       [-1.27901644,  0.36045575, -1.82494832, -0.63073987],
       [ 0.71114432,  0.64872248,  0.21360928,  0.05497365]])

In [80]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [82]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.544801  0.170126 -0.556132 -0.708491
std    0.863739  0.550155  0.869491  0.422358
min   -1.598511 -0.881555 -1.824948 -1.070701
25%   -1.181386  0.133932 -0.922093 -1.021473
50%   -0.513260  0.338387 -0.675796 -0.776219
75%   -0.091436  0.467874  0.006878 -0.628720
max    0.711144  0.648722  0.609503  0.054974

In [84]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.598511   -0.138026   -0.075906   -0.888494   -1.279016    0.711144
B    0.073137    0.503681    0.316318   -0.881555    0.360456    0.648722
C   -0.613317    0.609503   -0.738276   -0.983365   -1.824948    0.213609
D   -0.628046   -1.054731   -0.921699   -1.070701   -0.630740    0.054974

In [88]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.628046 -0.613317  0.073137 -1.598511
2013-01-02 -1.054731  0.609503  0.503681 -0.138026
2013-01-03 -0.921699 -0.738276  0.316318 -0.075906
2013-01-04 -1.070701 -0.983365 -0.881555 -0.888494
2013-01-05 -0.630740 -1.824948  0.360456 -1.279016
2013-01-06  0.054974  0.213609  0.648722  0.711144

In [90]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-04 -0.888494 -0.881555 -0.983365 -1.070701
2013-01-01 -1.598511  0.073137 -0.613317 -0.628046
2013-01-03 -0.075906  0.316318 -0.738276 -0.921699
2013-01-05 -1.279016  0.360456 -1.824948 -0.630740
2013-01-02 -0.138026  0.503681  0.609503 -1.054731
2013-01-06  0.711144  0.648722  0.213609  0.054974

Si seleccionamos una columna, nos va a devolver una Serie:

In [92]:
df['A']

2013-01-01   -1.598511
2013-01-02   -0.138026
2013-01-03   -0.075906
2013-01-04   -0.888494
2013-01-05   -1.279016
2013-01-06    0.711144
Freq: D, Name: A, dtype: float64

Si seleccionamos elementos a través de [], nos devolverá las filas:

In [98]:
df[1:3]

                   A         B         C         D
2013-01-02 -0.138026  0.503681  0.609503 -1.054731
2013-01-03 -0.075906  0.316318 -0.738276 -0.921699

In [99]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.138026  0.503681  0.609503 -1.054731
2013-01-03 -0.075906  0.316318 -0.738276 -0.921699
2013-01-04 -0.888494 -0.881555 -0.983365 -1.070701

### Filtrado

#### Selección por etiqueta

In [101]:
df.loc[dates[0]]

A   -1.598511
B    0.073137
C   -0.613317
D   -0.628046
Name: 2013-01-01 00:00:00, dtype: float64

In [103]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01 -1.598511  0.073137
2013-01-02 -0.138026  0.503681
2013-01-03 -0.075906  0.316318
2013-01-04 -0.888494 -0.881555
2013-01-05 -1.279016  0.360456
2013-01-06  0.711144  0.648722

In [105]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02 -0.138026  0.503681
2013-01-03 -0.075906  0.316318
2013-01-04 -0.888494 -0.881555

In [107]:
df.at[dates[0], 'A']

-1.5985110758715022

#### Selección por posición

In [109]:
df.iloc[3]

A   -0.888494
B   -0.881555
C   -0.983365
D   -1.070701
Name: 2013-01-04 00:00:00, dtype: float64

In [111]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.888494 -0.881555
2013-01-05 -1.279016  0.360456

In [113]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -0.138026  0.609503
2013-01-03 -0.075906 -0.738276
2013-01-05 -1.279016 -1.824948

In [115]:
df.iat[1, 1]

0.5036805812672245

#### Selección por condición (boolean indexing)

In [117]:
df[df.A > 0]

                   A         B         C         D
2013-01-06  0.711144  0.648722  0.213609  0.054974

In [119]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  0.073137       NaN       NaN
2013-01-02       NaN  0.503681  0.609503       NaN
2013-01-03       NaN  0.316318       NaN       NaN
2013-01-04       NaN       NaN       NaN       NaN
2013-01-05       NaN  0.360456       NaN       NaN
2013-01-06  0.711144  0.648722  0.213609  0.054974

Podemos usar el operador isin() para filtrar de una lista de valores

In [121]:
df2 = df.copy()
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01 -1.598511  0.073137 -0.613317 -0.628046    one
2013-01-02 -0.138026  0.503681  0.609503 -1.054731    one
2013-01-03 -0.075906  0.316318 -0.738276 -0.921699    two
2013-01-04 -0.888494 -0.881555 -0.983365 -1.070701  three
2013-01-05 -1.279016  0.360456 -1.824948 -0.630740   four
2013-01-06  0.711144  0.648722  0.213609  0.054974  three

In [123]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03 -0.075906  0.316318 -0.738276 -0.921699   two
2013-01-05 -1.279016  0.360456 -1.824948 -0.630740  four

### Operaciones básicas

In [125]:
df.mean()

A   -0.544801
B    0.170126
C   -0.556132
D   -0.708491
dtype: float64

In [127]:
df.mean(1)

2013-01-01   -0.691684
2013-01-02   -0.019893
2013-01-03   -0.354890
2013-01-04   -0.956029
2013-01-05   -0.843562
2013-01-06    0.407112
Freq: D, dtype: float64

In [129]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01 -1.598511  0.073137 -0.613317 -0.628046
2013-01-02 -1.736537  0.576817 -0.003813 -1.682778
2013-01-03 -1.812443  0.893135 -0.742089 -2.604476
2013-01-04 -2.700937  0.011580 -1.725454 -3.675177
2013-01-05 -3.979953  0.372036 -3.550403 -4.305917
2013-01-06 -3.268809  1.020758 -3.336793 -4.250944

#### Histogramas

In [131]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    1
1    3
2    4
3    1
4    2
5    1
6    4
7    4
8    0
9    5
dtype: int64

In [133]:
s.value_counts()

4    3
1    3
5    1
3    1
2    1
0    1
dtype: int64

#### Agrupar dataframes
Pandas proporciona varias facilidades para combinar fácilmente los objetos Series, DataFrame y Panel con varios tipos de lógica de conjunto para los índices y la funcionalidad de álgebra relacional en el caso de operaciones de join / merge

In [137]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0  2.768122  0.343627 -0.790805  1.515811
1 -0.936098 -1.288157  0.044848 -0.816567
2 -2.010196 -0.065394  0.325696 -0.176298
3  0.986171 -0.332544 -0.101965 -1.153559
4  0.457400 -0.165606  0.020054 -0.761870
5 -1.465269  2.532318  1.234889  0.078537
6 -0.251214 -0.766022  0.530390 -0.280123
7 -0.002803 -0.938278 -0.395981 -0.269223
8  1.782584 -1.918106 -0.992788 -0.629130
9  0.232342  0.303190  0.052893  0.400072

In [138]:
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0  2.768122  0.343627 -0.790805  1.515811
 1 -0.936098 -1.288157  0.044848 -0.816567
 2 -2.010196 -0.065394  0.325696 -0.176298,
           0         1         2         3
 3  0.986171 -0.332544 -0.101965 -1.153559
 4  0.457400 -0.165606  0.020054 -0.761870
 5 -1.465269  2.532318  1.234889  0.078537
 6 -0.251214 -0.766022  0.530390 -0.280123,
           0         1         2         3
 7 -0.002803 -0.938278 -0.395981 -0.269223
 8  1.782584 -1.918106 -0.992788 -0.629130
 9  0.232342  0.303190  0.052893  0.400072]

In [140]:
pd.concat(pieces)

          0         1         2         3
0  2.768122  0.343627 -0.790805  1.515811
1 -0.936098 -1.288157  0.044848 -0.816567
2 -2.010196 -0.065394  0.325696 -0.176298
3  0.986171 -0.332544 -0.101965 -1.153559
4  0.457400 -0.165606  0.020054 -0.761870
5 -1.465269  2.532318  1.234889  0.078537
6 -0.251214 -0.766022  0.530390 -0.280123
7 -0.002803 -0.938278 -0.395981 -0.269223
8  1.782584 -1.918106 -0.992788 -0.629130
9  0.232342  0.303190  0.052893  0.400072

In [146]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})
print(left)
print()
print(right)

   key  lval
0  foo     1
1  bar     2

   key  rval
0  foo     4
1  bar     5

In [148]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [150]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A', 'B', 'C', 'D'])
df

          A         B         C         D
0  0.386426 -0.369233  1.848229 -1.745291
1  0.106756  0.322383 -0.954767 -1.233728
2 -0.717745  0.418300 -0.982965  0.938884
3  0.453235 -0.218320  1.305947  0.803980
4  0.911305  1.161017 -1.632746 -0.117445
5  0.592013 -0.068466 -0.661673 -0.457976
6 -0.718705  0.086869  1.023535 -0.790343
7  1.147445  0.204527 -1.075425  2.222015

In [152]:
s = df.iloc[3]
df.append(s, ignore_index=True)

          A         B         C         D
0  0.386426 -0.369233  1.848229 -1.745291
1  0.106756  0.322383 -0.954767 -1.233728
2 -0.717745  0.418300 -0.982965  0.938884
3  0.453235 -0.218320  1.305947  0.803980
4  0.911305  1.161017 -1.632746 -0.117445
5  0.592013 -0.068466 -0.661673 -0.457976
6 -0.718705  0.086869  1.023535 -0.790343
7  1.147445  0.204527 -1.075425  2.222015
8  0.453235 -0.218320  1.305947  0.803980

#### Group by

In [156]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
                          'foo', 'bar', 'foo', 'foo'],
                   'B': ['one', 'one', 'two', 'three',
                         'two', 'two', 'one', 'three'],
                   'C': np.random.randn(8),
                   'D': np.random.randn(8)})
df

     A      B         C         D
0  foo    one  0.002519  0.123380
1  bar    one -0.068141 -0.126709
2  foo    two  0.403462 -1.011515
3  bar  three  0.227494  0.816037
4  foo    two  0.892864 -0.518780
5  bar    two  0.749214 -0.042479
6  foo    one -1.517035  0.440126
7  foo  three  1.052867  0.387212

In [158]:
df.groupby('A').sum()

            C         D
A
bar  0.908567  0.646849
foo  0.834676 -0.579576

In [159]:
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one   -0.068141 -0.126709
    three  0.227494  0.816037
    two    0.749214 -0.042479
foo one   -1.514517  0.563506
    three  1.052867  0.387212
    two    1.296326 -1.530295